package com.jing.bilibilitv.http.data

object ResponseErrorCode {

    fun resolveErrorMessage(code: Int): String {
        return codeMap[code] ?: "未知错误"
    }

    private val codeMap: Map<Int, String> = mapOf(
        -101 to "账号未登录",
        -102 to "账号被封停",
        -103 to "积分不足",
        -104 to "硬币不足",
        -105 to "验证码错误",
        -106 to "账号非正式会员或在适应期",
        -107 to "应用不存在或者被封禁",
        -108 to "未绑定手机",
        -110 to "未绑定手机",
        -111 to "csrf校验失败",
        -112 to "系统升级中",
        -113 to "账号尚未实名认证",
        -114 to "请先绑定手机",
        -115 to "请先完成实名认证",
        -304 to "木有改动",
        -307 to "撞车跳转",
        -400 to "请求错误",
        -401 to "未认证 (或非法请求)",
        -403 to "访问权限不足",
        -404 to "啥都木有",
        -405 to "不支持该方法",
        -409 to "冲突",
        -412 to "请求被拦截 (客户端 ip 被服务端风控)",
        -500 to "服务器错误",
        -503 to "过载保护,服务暂不可用",
        -504 to "服务调用超时",
        -509 to "超出限制",
        -616 to "上传文件不存在",
        -617 to "上传文件太大",
        -625 to "登录失败次数太多",
        -626 to "用户不存在",
        -628 to "密码太弱",
        -629 to "用户名或密码错误",
        -632 to "操作对象数量限制",
        -643 to "被锁定",
        -650 to "用户等级太低",
        -652 to "重复的用户",
        -658 to "Token 过期",
        -662 to "密码时间戳过期",
        -688 to "地理区域限制",
        -689 to "版权限制",
        -701 to "扣节操失败",
        -8888 to "对不起，服务器开小差了~ (ಥ﹏ಥ)",

        10003 to "不存在该稿件",
        65004 to "取消点赞失败",
        65006 to "重复点赞",
        34002 to "不能给自己投币",
        34003 to "非法的投币数量",
        34004 to "投币间隔太短",
        34005 to "超过投币上限"
    )
}